// const html =
// `<h1>Header</h1>
// <h3>Header</h3>
// <p>
// <b>Bold text</b>, <i>Italic text</i><br/ >
// <a href="http://www.ski-o.ru" target="__blank">Example link</a>
// </p>
// <ul>
//   <li>To do 1</li><li>To do 2</li>
// </ul>
// <ol>
//   <li>To do 1</li><li>To do 2</li>
// </ol>
// <pre>name  result</pre>
// <figure><img src="image2.jpg" /><figcaption>Caption 2</figcaption></figure>
// <figure><iframe src="https://www.youtube.com/embed/dQw4w9WgXcQ"></iframe><figcaption>Caption 3</figcaption></figure>
// <figure><iframe class="instagram-media instagram-media-rendered" id="instagram-embed-0" src="https://www.instagram.com/p/BMWm4GPjxEV" height="460" data-instgrm="true" data-instgrm-payload-id="instagram-media-payload-0" scrolling="no" style="background:rgb(255, 255, 255);border:0px;margin:1px;max-width:658px;width:calc(100% - 2px);border-radius:4px;box-shadow:rgba(0, 0, 0, 0.498039) 0px 0px 1px 0px, rgba(0, 0, 0, 0.14902) 0px 1px 10px 0px;display:block;padding:0px;"></iframe><figcaption>Caption 4</figcaption><</figure>
// `;

let html = `
<h2>Чемпионат и Первенство г.Москвы, лыжная гонка – лонг (65 / 75 мин)</h2>
<h3>Цели и задачи</h3>
<p>Развитие и популяризация спортивного ориентирования, как массово- оздоровительного и развивающего вида спорта среди всех слоев населения; выявление сильнейших спортсменов г.Москвы, развитие и укрепление спортивных и дружеских связей.</p>
<h3>Орг.комитет соревнований </h3>
<ul>
   <li>Главный судья – Елена Хельдерт (С1К), lenahel@mail.ru </li>
   <li>Зам. по СТО – Олег Калинин (С1К) </li>
   <li>Главный секретарь - Екатерина Филимонова (С1К) </li>
   <li>Судья финиша – Павел Тёмкин (С1К)</li>
</ul>
<h3>Сроки и место проведения</h3>
<p>19 февраля 2017 г. (воскресенье) – л/п Ромашково. Размещение участников на стадионе «Медик» (ул. Маршала Тимошенко, д.1)</p>
<p></p>
<figure><img src="image.jpg"></figure>
<p>Район соревнований <strong>ЗАКРЫТ</strong> для тренировок с картами до 19 февраля!</p>
<h3>Участники соревнований</h3>
<ul>
   <li>М12А (2005-2006г.г.), </li>
   <li>М14 (2003-2004г.г.), </li>
   <li>М17 (2000-2002г.г.), </li>
   <li>М20 (1997-1999г.г.), </li>
   <li>М21 (1996г. и старше – МС, КМС, 1р.) </li>
   <li>Ж12А (2005-2006г.г.), </li>
   <li>Ж14 (2003-2004г.г.), </li>
   <li>Ж17 (2000-2002г.г.), </li>
   <li>Ж20 (1997-1999г.г.), </li>
   <li>Ж21(1996г. и старше – МС, КМС, 1р.) </li>
   <li>М12Б и Ж12Б (2007г. и младше, начинающие 2005-2006г.), </li>
   <li>О1, О2 (открытые группы). </li>
</ul>
<p>Допускаются иногородние участники, которые не участвуют в розыгрыше медалей ЧиП г.Москвы.</p>
<p>Чемпионат г.Москвы проводится среди участников групп М21 и Ж21 согласно Положению о Чемпионате г.Москвы по спортивному ориентированию на лыжах 2017г. Участники групп МЖ12–20 участвуют в зачёте Первенства г.Москвы согласно Положению о Первенстве г.Москвы по спортивному ориентированию на лыжах 2017г. Ответственность за безопасность и сохранность жизни и здоровья участников в лесу (на дистанции) и во время соревнований (до старта и после финиша) возлагается на представителей команд, тренеров, самих участников. Участники соревнований до 20 лет включительно допускаются только при наличии допуска врача. </p>
<h3>Программа соревнований </h3>
`
+
`<figure>
   <table>
      <tbody>
         <tr>
            <th></th>
            <th></th>
         </tr>
         <tr>
            <td>09:00</td>
            <td>Начало работы секретариата </td>
         </tr>
         <tr>
            <td>11:00</td>
            <td>Начало старта Чемпионата и Первенства Москвы </td>
         </tr>
         <tr>
            <td>11:30-13:30</td>
            <td>Свободный старт открытых групп </td>
         </tr>
         <tr>
            <td>14:00</td>
            <td>Начало награждения на Медике (по мере формирования окончательных протоколов)</td>
         </tr>
      </tbody>
   </table>
   <figcaption>Таблица 1</figcaption>
</figure>`
+ `<p></p>
<h3>Спортивно-техническая информация</h3>
<p>Местность среднепересеченная, перепад на склоне до 50 м. Трассы подготовлены снегоходами с бороной. В районе соревнований есть стационарная лыжная трасса протяженностью 17 км. Процентное соотношение лыжней: Скоростная - 35% Быстрая - 65% Карта зимняя, масштаб в таблице, сечение рельефа 2,5м, не герметизирована. У групп М21 и М20 - переворот карты (не в месте старта), последний КП первого круга на карте второго круга обозначен знаком старта, нумерация сквозная. Остальные дистанции в один круг. Нумерация КП у всех групп двойная. Опасные места – лыжная трасса, крутые спуски на ней. Для удобства понимания направления движения по лыжной трассе будет использован специальный знак поверх знака лыжной трассы – красные стрелочки. Чтению карты он не мешает.</p>
`;
//
// import { convertToHTML, convertFromHTML } from 'draft-convert';
// import { convertToRaw, EditorState } from 'draft-js';
// console.log("convertFromHTML", convertToRaw(convertFromHTML({})(html)));

export default html;
